In [17]:
from dateutil import parser
from datetime import datetime
import numpy as np
import pandas as pd
import pickle

with open('data_import.pickle', 'rb') as file:
    mta = pickle.load(file)
mta.head()

,C/A,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,06/08/2019,00:00:00,REGULAR,7089463,2401758
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,06/08/2019,04:00:00,REGULAR,7089491,2401764
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,06/08/2019,08:00:00,REGULAR,7089511,2401807
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,06/08/2019,12:00:00,REGULAR,7089598,2401889
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,06/08/2019,16:00:00,REGULAR,7089801,2401946

In [18]:
# strip whitespace from column names
mta.columns = mta.columns.str.strip()

In [19]:
# convert date and time columns to datetime
mta['date_time'] = mta['DATE'] + ' ' + mta['TIME']
mta['date_time'] = mta['date_time'].apply(parser.parse)
mta.dtypes

C/A                  object
UNIT                 object
SCP                  object
STATION              object
LINENAME             object
DIVISION             object
DATE                 object
TIME                 object
DESC                 object
ENTRIES               int64
EXITS                 int64
date_time    datetime64[ns]
dtype: object

In [20]:
# define keys; look for duplicate entries of turnstile/datetime combinations
keys = ['C/A', 'UNIT', 'SCP', 'STATION', 'date_time']
(mta
 .groupby(keys, as_index = False)  
 .ENTRIES.count()
 .sort_values("ENTRIES", ascending=False)).head(15)

          C/A  UNIT       SCP          STATION           date_time  ENTRIES
386057   N045  R187  01-00-01     81 ST-MUSEUM 2019-06-02 17:00:00        2
1158130  R174  R034  00-00-02           125 ST 2019-06-08 00:00:00        2
386394   N045  R187  01-00-02     81 ST-MUSEUM 2019-06-02 17:00:00        2
386389   N045  R187  01-00-02     81 ST-MUSEUM 2019-06-01 17:00:00        2
386787   N045  R187  01-06-00     81 ST-MUSEUM 2019-06-11 21:00:00        2
432507   N071  R013  00-00-04   34 ST-PENN STA 2019-04-20 08:00:00        2
236238   G009  R151  02-00-03  CONEY IS-STILLW 2019-05-16 17:00:00        2
386732   N045  R187  01-06-00     81 ST-MUSEUM 2019-06-02 17:00:00        2
431152   N071  R013  00-00-00   34 ST-PENN STA 2019-04-20 08:00:00        2
1158468  R174  R034  00-00-03           125 ST 2019-06-08 00:00:00        2
1351470  R290  R161  00-00-00   KINGSBRIDGE RD 2019-06-07 05:00:00        2
236574   G009  R151  02-00-04  CONEY IS-STILLW 2019-05-16 17:00:00        2
432862   N071  R013  00-06-00   34 ST-PENN STA 2019-04-20 08:00:00        2
1157792  R174  R034  00-00-01           125 ST 2019-06-08 00:00:00        2
432861   N071  R013  00-06-00   34 ST-PENN STA 2019-04-20 04:00:00        2

In [21]:
# appears to be several duplicates, for example:
mask = ((mta["C/A"] == "R174") & 
(mta["UNIT"] == "R034") & 
(mta["SCP"] == "00-00-03") & 
(mta["STATION"] == "125 ST") &
(mta["date_time"].dt.date == datetime(2019, 6, 8).date()))

mta[mask].head()

,C/A,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS,date_time
145455,R174,R034,00-00-03,125 ST,1,IRT,06/08/2019,00:00:00,REGULAR,3828801,2853462,2019-06-08 00:00:00
145456,R174,R034,00-00-03,125 ST,1,IRT,06/08/2019,00:00:00,RECOVR AUD,3828804,2853463,2019-06-08 00:00:00
145457,R174,R034,00-00-03,125 ST,1,IRT,06/08/2019,08:00:00,REGULAR,3828931,2853610,2019-06-08 08:00:00
145458,R174,R034,00-00-03,125 ST,1,IRT,06/08/2019,12:00:00,REGULAR,3829164,2853787,2019-06-08 12:00:00
145459,R174,R034,00-00-03,125 ST,1,IRT,06/08/2019,16:00:00,REGULAR,3829514,2854060,2019-06-08 16:00:00

In [22]:
# drop duplicates
mta.drop_duplicates(subset=keys, inplace=True)
(mta
 .groupby(keys)
 .ENTRIES.count()
 .reset_index()
 .sort_values("ENTRIES", ascending=False)).head(5)

          C/A  UNIT       SCP         STATION           date_time  ENTRIES
0        A002  R051  02-00-00           59 ST 2019-04-20 00:00:00        1
1093705  R142  R293  01-00-03  34 ST-PENN STA 2019-04-26 18:00:00        1
1093715  R142  R293  01-00-03  34 ST-PENN STA 2019-04-28 10:00:00        1
1093714  R142  R293  01-00-03  34 ST-PENN STA 2019-04-28 06:00:00        1
1093713  R142  R293  01-00-03  34 ST-PENN STA 2019-04-28 02:00:00        1

In [23]:
# group by unique turnstile/date combinations and extract the first reported time
mta_by_date = mta.groupby(['C/A', 'UNIT', 'SCP', 'STATION', 'DATE'], 
                          as_index = False)['ENTRIES', 'EXITS'].first()
mta_by_date.head()

    C/A  UNIT       SCP STATION        DATE  ENTRIES    EXITS
0  A002  R051  02-00-00   59 ST  04/20/2019  7026702  2382234
1  A002  R051  02-00-00   59 ST  04/21/2019  7027457  2382455
2  A002  R051  02-00-00   59 ST  04/22/2019  7028053  2382642
3  A002  R051  02-00-00   59 ST  04/23/2019  7029313  2383025
4  A002  R051  02-00-00   59 ST  04/24/2019  7030821  2383462

In [24]:
# define column for the previous day and entries/exits for that day
mta_by_date[["PREV_DATE", "PREV_ENTRIES", "PREV_EXITS"]] = \
mta_by_date.groupby(["C/A", "UNIT", "SCP", "STATION"])["DATE", "ENTRIES", "EXITS"].\
transform(lambda x: x.shift(1))

mta_by_date.head()

,C/A,UNIT,SCP,STATION,DATE,ENTRIES,EXITS,PREV_DATE,PREV_ENTRIES,PREV_EXITS
0,A002,R051,02-00-00,59 ST,04/20/2019,7026702,2382234,NaN,NaN,NaN
1,A002,R051,02-00-00,59 ST,04/21/2019,7027457,2382455,04/20/2019,7026702.0,2382234.0
2,A002,R051,02-00-00,59 ST,04/22/2019,7028053,2382642,04/21/2019,7027457.0,2382455.0
3,A002,R051,02-00-00,59 ST,04/23/2019,7029313,2383025,04/22/2019,7028053.0,2382642.0
4,A002,R051,02-00-00,59 ST,04/24/2019,7030821,2383462,04/23/2019,7029313.0,2383025.0

In [25]:
# remove initial day for each turnstile, since it has no prior day for reference
mta_by_date.dropna(subset=["PREV_DATE"], axis=0, inplace=True)

In [26]:
# remove rows with negative entries and/or exits relative to previous day (likely errors)
print(mta_by_date[mta_by_date["ENTRIES"] < mta_by_date["PREV_ENTRIES"]].count())
print(mta_by_date[mta_by_date["EXITS"] < mta_by_date["PREV_EXITS"]].count())
mta_by_date = mta_by_date[mta_by_date["ENTRIES"] >= mta_by_date["PREV_ENTRIES"]]
mta_by_date = mta_by_date[mta_by_date["EXITS"] >= mta_by_date["PREV_EXITS"]]
mta_by_date.head()

C/A             2950
UNIT            2950
SCP             2950
STATION         2950
DATE            2950
ENTRIES         2950
EXITS           2950
PREV_DATE       2950
PREV_ENTRIES    2950
PREV_EXITS      2950
dtype: int64
C/A             2497
UNIT            2497
SCP             2497
STATION         2497
DATE            2497
ENTRIES         2497
EXITS           2497
PREV_DATE       2497
PREV_ENTRIES    2497
PREV_EXITS      2497
dtype: int64

,C/A,UNIT,SCP,STATION,DATE,ENTRIES,EXITS,PREV_DATE,PREV_ENTRIES,PREV_EXITS
1,A002,R051,02-00-00,59 ST,04/21/2019,7027457,2382455,04/20/2019,7026702.0,2382234.0
2,A002,R051,02-00-00,59 ST,04/22/2019,7028053,2382642,04/21/2019,7027457.0,2382455.0
3,A002,R051,02-00-00,59 ST,04/23/2019,7029313,2383025,04/22/2019,7028053.0,2382642.0
4,A002,R051,02-00-00,59 ST,04/24/2019,7030821,2383462,04/23/2019,7029313.0,2383025.0
5,A002,R051,02-00-00,59 ST,04/25/2019,7032351,2383896,04/24/2019,7030821.0,2383462.0

In [27]:
#Drop old date column and reassign "PREV_DATE" as new "DATE"
mta_by_date.drop(columns='DATE', axis=1, inplace = True)
mta_by_date.rename(index = str, columns = {'PREV_DATE': 'DATE'}, inplace = True)
mta_by_date['DATE'] = pd.to_datetime(mta_by_date.DATE, format = '%m/%d/%Y')

#Add column for day of week and convert it to English names
dayOfWeek={0:'Monday', 1:'Tuesday', 2:'Wednesday', 3:'Thursday', 4:'Friday', 5:'Saturday', 6:'Sunday'}
mta_by_date['weekday'] = mta_by_date.DATE.apply(datetime.weekday)
mta_by_date['weekday'] = mta_by_date['weekday'].map(dayOfWeek)

mta_by_date.head()

,C/A,UNIT,SCP,STATION,ENTRIES,EXITS,DATE,PREV_ENTRIES,PREV_EXITS,weekday
1,A002,R051,02-00-00,59 ST,7027457,2382455,2019-04-20,7026702.0,2382234.0,Saturday
2,A002,R051,02-00-00,59 ST,7028053,2382642,2019-04-21,7027457.0,2382455.0,Sunday
3,A002,R051,02-00-00,59 ST,7029313,2383025,2019-04-22,7028053.0,2382642.0,Monday
4,A002,R051,02-00-00,59 ST,7030821,2383462,2019-04-23,7029313.0,2383025.0,Tuesday
5,A002,R051,02-00-00,59 ST,7032351,2383896,2019-04-24,7030821.0,2383462.0,Wednesday

In [28]:
#Calculate total daily entries and exits and save as columns
mta_by_date['daily_entries'] = mta_by_date['ENTRIES'] - mta_by_date['PREV_ENTRIES']
mta_by_date['daily_exits'] = mta_by_date['EXITS'] - mta_by_date['PREV_EXITS']
mta_by_date.head()

,C/A,UNIT,SCP,STATION,ENTRIES,EXITS,DATE,PREV_ENTRIES,PREV_EXITS,weekday,daily_entries,daily_exits
1,A002,R051,02-00-00,59 ST,7027457,2382455,2019-04-20,7026702.0,2382234.0,Saturday,755.0,221.0
2,A002,R051,02-00-00,59 ST,7028053,2382642,2019-04-21,7027457.0,2382455.0,Sunday,596.0,187.0
3,A002,R051,02-00-00,59 ST,7029313,2383025,2019-04-22,7028053.0,2382642.0,Monday,1260.0,383.0
4,A002,R051,02-00-00,59 ST,7030821,2383462,2019-04-23,7029313.0,2383025.0,Tuesday,1508.0,437.0
5,A002,R051,02-00-00,59 ST,7032351,2383896,2019-04-24,7030821.0,2383462.0,Wednesday,1530.0,434.0

In [29]:
#Check for outliers in daily_entries
outliers = mta_by_date[mta_by_date.daily_entries > 2000].sort_values('daily_entries', ascending=False)
outliers.head(10)

,C/A,UNIT,SCP,STATION,ENTRIES,EXITS,DATE,PREV_ENTRIES,PREV_EXITS,weekday,daily_entries,daily_exits
268233,R729,R292,00-00-02,BAYCHESTER AV,2063649382,167819261,2019-05-16,8123310.0,690029.0,Thursday,2.055526e+09,1.671292e+08
269431,S101A,R070,01-00-03,ST. GEORGE,1129054878,1078346838,2019-05-02,2501599.0,432.0,Thursday,1.126553e+09,1.078346e+09
231971,R332,R365,00-00-00,219 ST,905996437,318827912,2019-05-17,3558247.0,1250026.0,Friday,9.024382e+08,3.175779e+08
231914,R331,R364,00-05-01,GUN HILL RD,683737068,638320619,2019-05-10,458752.0,196.0,Friday,6.832783e+08,6.383204e+08
219089,R257,R182,01-03-01,116 ST,637574909,587237592,2019-05-09,2502854.0,2345207.0,Thursday,6.350721e+08,5.848924e+08
222664,R287,R244,00-05-00,BURNSIDE AV,607126914,1008468974,2019-04-30,594465.0,237261.0,Tuesday,6.065324e+08,1.008232e+09
80440,N098,R028,00-02-00,FULTON ST,569320813,569323232,2019-05-24,4807409.0,9992360.0,Friday,5.645134e+08,5.593309e+08
224269,R293,R133,00-06-01,MOSHOLU PKWY,452993428,67129009,2019-06-06,1830432.0,301900.0,Thursday,4.511630e+08,6.682711e+07
65704,N056,R188,01-00-01,50 ST,335092671,335092104,2019-05-07,3422305.0,2643003.0,Tuesday,3.316704e+08,3.324491e+08
233848,R405,R447,01-00-01,CYPRESS AV,184609880,251723194,2019-04-20,740844.0,1030141.0,Saturday,1.838690e+08,2.506931e+08

In [30]:
#Remove rows with outliers in daily_entries and daily_exits
mta_by_date = mta_by_date[(mta_by_date.daily_entries < 20000) & (mta_by_date.daily_exits < 20000)]

In [31]:
mta.to_pickle('turnstiles_full.pickle')
mta_by_date.to_pickle('turnstiles_by_day.pickle')